
create_clock -period 1.600 -name system_clk -waveform {0.000 0.800} [get_ports SYS_CLK]
create_clock -period 1.600 -name recovered_clk -waveform {0.000 0.800} [get_ports RCV_CLK]
create_clock -period 6.000 -name client_clk -waveform {0.000 3.000} [get_ports CLNT_CLK]
set_input_delay -clock [get_clocks client_clk] 2.400 [get_ports {{TX_DATA[0]} {TX_DATA[1]} {TX_DATA[2]} {TX_DATA[3]} {TX_DATA[4]} {TX_DATA[5]} {TX_DATA[6]} {TX_DATA[7]} {TX_DATA[8]} {TX_DATA[9]} {TX_DATA[10]} {TX_DATA[11]} {TX_DATA[12]} {TX_DATA[13]} {TX_DATA[14]} {TX_DATA[15]} {TX_DATA[16]} {TX_DATA[17]} {TX_DATA[18]} {TX_DATA[19]} {TX_DATA[20]} {TX_DATA[21]} {TX_DATA[22]} {TX_DATA[23]} {TX_DATA[24]} {TX_DATA[25]} {TX_DATA[26]} {TX_DATA[27]} {TX_DATA[28]} {TX_DATA[29]} {TX_DATA[30]} {TX_DATA[31]} {TX_DATA[32]} {TX_DATA[33]} {TX_DATA[34]} {TX_DATA[35]} {TX_DATA[36]} {TX_DATA[37]} {TX_DATA[38]} {TX_DATA[39]} {TX_DATA[40]} {TX_DATA[41]} {TX_DATA[42]} {TX_DATA[43]} {TX_DATA[44]} {TX_DATA[45]} {TX_DATA[46]} {TX_DATA[47]} {TX_DATA[48]} {TX_DATA[49]} {TX_DATA[50]} {TX_DATA[51]} {TX_DATA[52]} {TX_DATA[53]} {TX_DATA[54]} {TX_DATA[55]} {TX_DATA[56]} {TX_DATA[57]} {TX_DATA[58]} {TX_DATA[59]} {TX_DATA[60]} {TX_DATA[61]} {TX_DATA[62]} {TX_DATA[63]} TX_EOP TX_ERROR TX_SOP TX_VALID {V_B[0]} {V_B[1]} {V_B[2]}}]
set_input_delay -clock [get_clocks recovered_clk] 0.640 [get_ports {{RXC[0]} {RXC[1]} {RXC[2]} {RXC[3]} {RXC[4]} {RXC[5]} {RXC[6]} {RXC[7]} {RXD[0]} {RXD[1]} {RXD[2]} {RXD[3]} {RXD[4]} {RXD[5]} {RXD[6]} {RXD[7]} {RXD[8]} {RXD[9]} {RXD[10]} {RXD[11]} {RXD[12]} {RXD[13]} {RXD[14]} {RXD[15]} {RXD[16]} {RXD[17]} {RXD[18]} {RXD[19]} {RXD[20]} {RXD[21]} {RXD[22]} {RXD[23]} {RXD[24]} {RXD[25]} {RXD[26]} {RXD[27]} {RXD[28]} {RXD[29]} {RXD[30]} {RXD[31]} {RXD[32]} {RXD[33]} {RXD[34]} {RXD[35]} {RXD[36]} {RXD[37]} {RXD[38]} {RXD[39]} {RXD[40]} {RXD[41]} {RXD[42]} {RXD[43]} {RXD[44]} {RXD[45]} {RXD[46]} {RXD[47]} {RXD[48]} {RXD[49]} {RXD[50]} {RXD[51]} {RXD[52]} {RXD[53]} {RXD[54]} {RXD[55]} {RXD[56]} {RXD[57]} {RXD[58]} {RXD[59]} {RXD[60]} {RXD[61]} {RXD[62]} {RXD[63]}}]
set_output_delay -clock [get_clocks client_clk] 2.400 [get_ports {{MA_DATA[0]} {MA_DATA[1]} {MA_DATA[2]} {MA_DATA[3]} {MA_DATA[4]} {MA_DATA[5]} {MA_DATA[6]} {MA_DATA[7]} {MA_DATA[8]} {MA_DATA[9]} {MA_DATA[10]} {MA_DATA[11]} {MA_DATA[12]} {MA_DATA[13]} {MA_DATA[14]} {MA_DATA[15]} {MA_DATA[16]} {MA_DATA[17]} {MA_DATA[18]} {MA_DATA[19]} {MA_DATA[20]} {MA_DATA[21]} {MA_DATA[22]} {MA_DATA[23]} {MA_DATA[24]} {MA_DATA[25]} {MA_DATA[26]} {MA_DATA[27]} {MA_DATA[28]} {MA_DATA[29]} {MA_DATA[30]} {MA_DATA[31]} {MA_DATA[32]} {MA_DATA[33]} {MA_DATA[34]} {MA_DATA[35]} {MA_DATA[36]} {MA_DATA[37]} {MA_DATA[38]} {MA_DATA[39]} {MA_DATA[40]} {MA_DATA[41]} {MA_DATA[42]} {MA_DATA[43]} {MA_DATA[44]} {MA_DATA[45]} {MA_DATA[46]} {MA_DATA[47]} {MA_DATA[48]} {MA_DATA[49]} {MA_DATA[50]} {MA_DATA[51]} {MA_DATA[52]} {MA_DATA[53]} {MA_DATA[54]} {MA_DATA[55]} {MA_DATA[56]} {MA_DATA[57]} {MA_DATA[58]} {MA_DATA[59]} {MA_DATA[60]} {MA_DATA[61]} {MA_DATA[62]} {MA_DATA[63]} {MA_DATA_VALID[0]} {MA_DATA_VALID[1]} {MA_DATA_VALID[2]} MA_FRAME_END MA_FRAME_ERROR MA_FRAME_START}]
set_output_delay -clock [get_clocks system_clk] 0.640 [get_ports {PCS_CLK {PLS_DATA_IND[0]} {PLS_DATA_IND[1]} {PLS_DATA_IND[2]} {PLS_DATA_IND[3]} {PLS_DATA_IND[4]} {PLS_DATA_IND[5]} {PLS_DATA_IND[6]} {PLS_DATA_IND[7]} {PLS_DATA_IND[8]} {PLS_DATA_IND[9]} {PLS_DATA_IND[10]} {PLS_DATA_IND[11]} {PLS_DATA_IND[12]} {PLS_DATA_IND[13]} {PLS_DATA_IND[14]} {PLS_DATA_IND[15]} {PLS_DATA_IND[16]} {PLS_DATA_IND[17]} {PLS_DATA_IND[18]} {PLS_DATA_IND[19]} {PLS_DATA_IND[20]} {PLS_DATA_IND[21]} {PLS_DATA_IND[22]} {PLS_DATA_IND[23]} {PLS_DATA_IND[24]} {PLS_DATA_IND[25]} {PLS_DATA_IND[26]} {PLS_DATA_IND[27]} {PLS_DATA_IND[28]} {PLS_DATA_IND[29]} {PLS_DATA_IND[30]} {PLS_DATA_IND[31]} {PLS_DATA_IND[32]} {PLS_DATA_IND[33]} {PLS_DATA_IND[34]} {PLS_DATA_IND[35]} {PLS_DATA_IND[36]} {PLS_DATA_IND[37]} {PLS_DATA_IND[38]} {PLS_DATA_IND[39]} {PLS_DATA_IND[40]} {PLS_DATA_IND[41]} {PLS_DATA_IND[42]} {PLS_DATA_IND[43]} {PLS_DATA_IND[44]} {PLS_DATA_IND[45]} {PLS_DATA_IND[46]} {PLS_DATA_IND[47]} {PLS_DATA_IND[48]} {PLS_DATA_IND[49]} {PLS_DATA_IND[50]} {PLS_DATA_IND[51]} {PLS_DATA_IND[52]} {PLS_DATA_IND[53]} {PLS_DATA_IND[54]} {PLS_DATA_IND[55]} {PLS_DATA_IND[56]} {PLS_DATA_IND[57]} {PLS_DATA_IND[58]} {PLS_DATA_IND[59]} {PLS_DATA_IND[60]} {PLS_DATA_IND[61]} {PLS_DATA_IND[62]} {PLS_DATA_IND[63]} {PLS_DATA_IND_VALID[0]} {PLS_DATA_IND_VALID[1]} {PLS_DATA_IND_VALID[2]} {PLS_DATA_IND_VALID[3]} {PLS_DATA_IND_VALID[4]} {PLS_DATA_IND_VALID[5]} {PLS_DATA_IND_VALID[6]} {PLS_DATA_IND_VALID[7]}}]
set_output_delay -clock [get_clocks client_clk] 2.400 [get_ports {RX_READY TX_READY}]
